Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: https://github.com/quarkusio/quarkus/blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qwc/qwc-footer.js[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qwc/qwc-footer.js[サンプルコード]

source: https://github.com/quarkusio/quarkus/blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qwc/qwc-server-log.js[Example code]
ja_jp: https://github.com/quarkusio/quarkus/blob/main/extensions/vertx-http/dev-ui-resources/src/main/resources/dev-ui/qwc/qwc-server-log.js[サンプルコード]

source: https://github.com/quarkusio/quarkus/discussions/23453[Sign up for a tour stop!]
ja_jp: link:https://github.com/quarkusio/quarkus/discussions/23453[ツアーストップに登録しよう]

source: https://github.com/quarkusio/quarkus/discussions/23454[Become a Roadie!]
ja_jp: link:https://github.com/quarkusio/quarkus/discussions/23454[ローディーになろう]

source: https://github.com/quarkusio/quarkus/issues[Let us know] in either case so we can together improve the migration script.
ja_jp: いずれの場合も、移行スクリプトを一緒に改善するため、 link:https://github.com/quarkusio/quarkus/issues[お知らせ] ください。

source: https://github.com/quarkusio/quarkus/pull/16857[#16857] - Add Amazon SSM extension
ja_jp: link:https://github.com/quarkusio/quarkus/pull/16857[#16857]- Amazon SSMエクステンションの追加

source: https://github.com/quarkusio/quarkus/pull/16951[#16951] - Add support for hibernate.metadata_builder_contributor
ja_jp: link:https://github.com/quarkusio/quarkus/pull/16951[#16951]- hibernate.metadata_builder_contributor のサポートを追加

source: https://github.com/quarkusio/quarkus/pull/16963[#16963] - Add `quarkus:test` goal
ja_jp: link:https://github.com/quarkusio/quarkus/pull/16963[#16963]- `quarkus:test` ゴールを追加

source: https://github.com/quarkusio/quarkus/pull/17014[#17014] - Update to GraalVM 21.1
ja_jp: link:https://github.com/quarkusio/quarkus/pull/17014[#17014]- GraalVM 21.1へのアップデート

source: https://github.com/quarkusio/quarkus/pull/17056[#17056] - Add support for coroutines to the rest client
ja_jp: link:https://github.com/quarkusio/quarkus/pull/17056[#17056]- restクライアントにコルーチンのサポートを追加

source: https://github.com/quarkusio/quarkus/pull/17232[#17232] - Introduce coroutine support in Reactive Messaging
ja_jp: link:https://github.com/quarkusio/quarkus/pull/17232[#17232]- Reactive Messagingにおけるcoroutineサポートの導入

source: https://github.com/quarkusio/quarkus/pull/17350[#17350] - SmallRye GraphQL Client extension + 1.2.1 upgrade
ja_jp: link:https://github.com/quarkusio/quarkus/pull/17350[#17350]- SmallRye GraphQL クライアントエクステンション + 1.2.1 アップグレード

source: https://github.com/quarkusio/quarkus/pull/47997[#47997] - Automatic Consul Registration for Quarkus Applications
ja_jp: https://github.com/quarkusio/quarkus/pull/47997[#47997] - Quarkus アプリケーションの自動 Consul 登録

source: https://github.com/quarkusio/quarkus/pull/50058[#50058] - Introduce Panache Next, our next generation of Panache with improved developer experience and new features for both Hibernate ORM and Hibernate Reactive
ja_jp: link:https://github.com/quarkusio/quarkus/pull/50058[#50058] - 開発者エクスペリエンスが向上し、Hibernate ORMとHibernate Reactiveの両方に新機能が追加された次世代PanacheであるPanache Nextの導入

source: https://github.com/quarkusio/quarkus/pull/50519[#50519] - Upgrade to Hibernate ORM 7.2, Reactive 3.2, Search 8.2, Elasticsearch 9.2 / OpenSearch 3.3 for clients / server (dev services)
ja_jp: link:https://github.com/quarkusio/quarkus/pull/50519[#50519] - Hibernate ORM 7.2、Reactive 3.2、Search 8.2、クライアント/サーバー向けElasticsearch 9.2 / OpenSearch 3.3 (dev services) へのアップグレード

source: https://github.com/quarkusio/quarkus/pull/50603[#50603] - Enable headless AWT on Windows for native images
ja_jp: link:https://github.com/quarkusio/quarkus/pull/50603[#50603] - ネイティブイメージ向けWindowsでのヘッドレスAWTの有効化

source: https://github.com/quarkusio/quarkus/pull/50975[#50975] - Rework graceful shutdown to be more graceful with respect to HTTP
ja_jp: https://github.com/quarkusio/quarkus/pull/50975[#50975] - HTTP に関してより優雅になるよう、優雅なシャットダウンを再構築

source: https://github.com/quarkusio/quarkus/pull/50987[#50987] - Support security annotations on Jakarta Data repositories
ja_jp: link:https://github.com/quarkusio/quarkus/pull/50987[#50987] - Jakarta Data リポジトリーにおけるセキュリティアノテーションのサポート

source: https://github.com/quarkusio/quarkus/pull/51049[#51049] - Add i18n to Dev UI
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51049[#51049] - Dev UIにi18nを追加

source: https://github.com/quarkusio/quarkus/pull/51188[#51188] - Support `@PermissionsAllowed` security annotation on REST Data Panache endpoints
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51188[#51188] - REST Data Panache エンドポイントでの `@PermissionsAllowed` セキュリティアノテーションのサポート

source: https://github.com/quarkusio/quarkus/pull/51220[#51220] - Encrypt OIDC tokens for custom TokenStateManager implementations
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51220[#51220] - カスタム TokenStateManager 実装向けのOIDCトークンの暗号化

source: https://github.com/quarkusio/quarkus/pull/51314[#51314] - Upgrade to Testcontainers 2
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51314[#51314] - Testcontainers 2 へのアップグレード

source: https://github.com/quarkusio/quarkus/pull/51383[#51383] - Allow to configure OIDC DB token state manager column sizes for tokens
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51383[#51383] - トークン向けのOIDC DBトークンステートマネージャーカラムサイズの設定を許可

source: https://github.com/quarkusio/quarkus/pull/51412[#51412] - Upgrade to JUnit 6
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51412[#51412] - JUnit 6 へのアップグレード

source: https://github.com/quarkusio/quarkus/pull/51586[#51586] - Hibernate Spatial support
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51586[#51586] - Hibernate Spatial のサポート

source: https://github.com/quarkusio/quarkus/pull/51587[#51587] - Introduce a quarkus Maven packaging and an assorted lifecycle
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51587[#51587] - Quarkus Mavenパッケージングと関連するライフサイクルの導入

source: https://github.com/quarkusio/quarkus/pull/51679[#51679] - Allow to assign a user and roles to a scheduled task
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51679[#51679] - スケジュールされたタスクにユーザーとロールを割り当てることを許可

source: https://github.com/quarkusio/quarkus/pull/51736[#51736] - Require Maven 3.9.0+ for Quarkus projects
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51736[#51736] - QuarkusプロジェクトにはMaven 3.9.0+を要求

source: https://github.com/quarkusio/quarkus/pull/51743[#51743] - Allow to select OIDC client for individual dynamic GraphQL clients
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51743[#51743] - 個々の動的GraphQLクライアント向けOIDCクライアントの選択を許可

source: https://github.com/quarkusio/quarkus/pull/51799[#51799] - Add support for OAuth 2.0 Pushed Authorization Requests to OIDC extension
ja_jp: link:https://github.com/quarkusio/quarkus/pull/51799[#51799] - OIDCエクステンションへのOAuth 2.0 Pushed Authorization Requestsのサポート追加

source: https://github.com/quarkusio/quarkus/pull/52090[#52090] - OIDC: Support for custom DPoP nonce providers
ja_jp: https://github.com/quarkusio/quarkus/pull/52090[#52090] - OIDC: カスタム DPoP ノンスプロバイダーのサポート

source: https://github.com/quarkusio/quarkus/pull/52175[#52175] - Make built-in authentication mechanism order customizable
ja_jp: https://github.com/quarkusio/quarkus/pull/52175[#52175] - 組み込みの認証メカニズムの順序をカスタマイズ可能にする

source: https://github.com/quarkusio/quarkus/pull/52353[#52353] - OIDC: Add basic support for rich authorization requests
ja_jp: https://github.com/quarkusio/quarkus/pull/52353[#52353] - OIDC: リッチ認可リクエストの基本的なサポートを追加

source: https://github.com/quarkusio/quarkus/pull/52376[#52376] and https://github.com/quarkusio/quarkus/pull/52224[#52224] - Project Leyden integration
ja_jp: https://github.com/quarkusio/quarkus/pull/52376[#52376] および https://github.com/quarkusio/quarkus/pull/52224[#52224] - Project Leyden の統合

source: https://github.com/quarkusio/quarkus/pull/52380[#52380] - Upgrade to Google Cloud Function framework 2.0
ja_jp: https://github.com/quarkusio/quarkus/pull/52380[#52380] - Google Cloud Function フレームワーク 2.0 へのアップグレード

source: https://github.com/quarkusio/quarkus/pull/52537[#52537] - Introduce OIDC AuthenticationCompletionAction
ja_jp: https://github.com/quarkusio/quarkus/pull/52537[#52537] - OIDC AuthenticationCompletionAction の導入

source: https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/devtools-common/src/main/java/io/quarkus/devtools/codestarts/quarkus[Quarkus implementation of the Codestart generator, window="_blank"]
ja_jp: link:https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/devtools-common/src/main/java/io/quarkus/devtools/codestarts/quarkus[CodestartジェネレーターのQuarkusによる実装, window=_blank]

source: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.28[Migration guide for 3.28]
ja_jp: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.28[3.28の移行ガイド]

source: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.29[Migration guide for 3.29]
ja_jp: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.29[3.29の移行ガイド]

source: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.30[Migration guide for 3.30]
ja_jp: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.30[3.30の移行ガイド]

source: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31[Migration guide for 3.31]
ja_jp: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31[3.31の移行ガイド]

source: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.32[Migration guide for 3.32]
ja_jp: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.32[3.32の移行ガイド]

source: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.33[Migration guide for 3.33] - this one is empty as 3.33 is the continuation of 3.32
ja_jp: https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.33[3.33の移行ガイド] - 3.33は3.32の継続であるため、このガイドは空です

source: https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md[1.10.0 Changelog]
ja_jp: link:https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md[1.10.0 Changelog]

source: https://github.com/redhat-developer/vscode-quarkus/issues/new[Open a GitHub issue]
ja_jp: link:https://github.com/redhat-developer/vscode-quarkus/issues/new[GitHubの課題を開く]

source: https://github.com/redhat-developer/vscode-quarkus/tree/master/docs/qute[VSCode Quarkus Documentation]
ja_jp: link:https://github.com/redhat-developer/vscode-quarkus/tree/master/docs/qute[VSCode Quarkusドキュメンテーション]

source: https://github.com/redhat-developer/vscode-quarkus[GitHub repository]
ja_jp: link:https://github.com/redhat-developer/vscode-quarkus[GitHubリポジトリ]

source: https://github.com/smallrye/smallrye-config[SmallRye Config] provides an interceptor chain that hooks into the configuration values resolution. This is useful to implement features like xref:config-reference.adoc#profiles[Profiles], xref:config-reference.adoc#property-expressions[Property Expressions], or just logging to find out where the config value was loaded from.
ja_jp: link:https://github.com/smallrye/smallrye-config[SmallRye Config]は、設定値の解決をフックするインターセプターチェーンを提供します。これは、 link:config-reference.html#profiles[プロファイル]や link:config-reference.html#property-expressions[プロパティExpressions]のような機能を実装するのに便利で、また、設定値がどこから読み込まれたかを調べるためのロギングにも役立ちます。

source: https://github.com/spring-projects/spring-data-jpa/blob/main/src/main/asciidoc/jpa.adoc#entity-state-detection-strategies[Entity State-detection Strategies] via `EntityInformation`.
ja_jp: `EntityInformation` 経由の https://github.com/spring-projects/spring-data-jpa/blob/main/src/main/asciidoc/jpa.adoc#entity-state-detection-strategies[エンティティーステート検出戦略].

source: https://groups.google.com/g/Quarkus-dev/c/KXzJ2UPGRvI/m/3AEsLvZNBAAJ[application.properties included in archive]
ja_jp: link:https://groups.google.com/g/Quarkus-dev/c/KXzJ2UPGRvI/m/3AEsLvZNBAAJ[アーカイブに含まれるapplication.properties]

source: https://grpc.io/[gRPC] is a high-performance RPC framework. It can efficiently connect services implemented using various languages and frameworks. It is also applicable in the last mile of distributed computing to connect devices, mobile applications, and browsers to backend services.
ja_jp: link:https://grpc.io/[gRPC] は高性能なRPCフレームワークです。様々な言語やフレームワークを使って実装されたサービスを効率的に接続することができます。また、デバイスやモバイルアプリケーション、ブラウザとバックエンドサービスを接続するために、分散コンピューティングのラストワンマイルにも適用可能です。

source: https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Create the project], you should end up with a `pom.xml` which contains the following properties and dependencies:
ja_jp: https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[プロジェクトを作成] すると、以下のプロパティーと依存関係を含む `pom.xml` が作成されます。

source: https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#qualifiers[Qualifiers, window="_blank"] are annotations that help the container to distinguish beans that implement the same type. As we already said a bean is assignable to an injection point if it has all the required qualifiers. If you declare no qualifier at an injection point the `@Default` qualifier is assumed.
ja_jp: https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#qualifiers[修飾子, window=_blank]は、コンテナが同じ型を実装するBeanを区別するのに役立つアノテーションです。すでに述べたように、Beanは必要な修飾子をすべて持っていれば、注入ポイントに割り当てることができます。注入ポイントで修飾子を宣言していない場合、 `@Default` の修飾子が推定されます。

source: https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#qualifiers[Qualifiers, window="_blank"] are annotations that help the container to distinguish beans that implement the same type. As we already said a bean is assignable to an injection point if it has all the required qualifiers. If you declare no qualifier at an injection point the `@Default` qualifier is assumed.
ja_jp: link:https://jakarta.ee/specifications/cdi/4.0/jakarta-cdi-spec-4.0.html#qualifiers[修飾子] は，コンテナが同じ型を実装するBeanを区別するのに役立つアノテーションです。 すでに述べたように、Beanは、必要な修飾子がすべてあれば注入ポイントに割り当て可能です。注入ポイントで修飾子を宣言しない場合、 `@Default` 修飾子が仮定されます。

source: https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#qualifiers[Qualifiers, window="_blank"] are annotations that help the container to distinguish beans that implement the same type. As we already said a bean is assignable to an injection point if it has all the required qualifiers. If you declare no qualifier at an injection point the `@Default` qualifier is assumed.
ja_jp: https://jakarta.ee/specifications/cdi/4.1/jakarta -cdi-spec-4.1.html#qualifiers[修飾子、window="_blank"] は、コンテナーが同じタイプを実装する Bean を区別するのに役立つアノテーションです。 すでに述べたように、Bean は、必要な修飾子がすべて揃っている場合に注入ポイントに割り当てることができます。 注入ポイントで修飾子を宣言しない場合は、 `@Default` 修飾子が想定されます。

source: https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#qualifiers[Qualifiers, window="_blank"] are annotations that help the container to distinguish beans that implement the same type. As we already said, a bean is assignable to an injection point if it has all the required qualifiers. If you declare no qualifier at an injection point, the `@Default` qualifier is assumed.
ja_jp: https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#qualifiers[修飾子, window="_blank"] は、同じ型を実装する Bean をコンテナーが区別するのに役立つアノテーションです。 既に述べたように、Bean は必要なすべての修飾子を持っている場合、インジェクションポイントに割り当て可能です。 インジェクションポイントで修飾子を宣言しない場合、 `@Default` 修飾子が想定されます。

source: https://javaee.github.io/jaxb-v2/[XML support]
ja_jp: https://javaee.github.io/jaxb-v2/[XML サポート]

source: https://kafka.apache.org/[Apache] Kafka is a prevalent distributed streaming platform offering a unique set of characteristics such as message retention, replay capabilities, consumer groups, and so on. Kafka is highly scalable, fault-tolerant, and is becoming the spine of many modern systems. That being said, Kafka is not the only one out there, and choosing the right messaging technology for your application can be challenging. There are many articles to help you drive your decision, such as https://medium.com/@graemecolman/mind-your-amqps-or-kafka-or-interconnect-what-is-in-the-red-hat-messaging-box-9ed5aa590e92[this one]. This post is about Kafka, and an equivalent post about AMQP will be published later.
ja_jp: link:https://kafka.apache.org/[Apache Kafka] は、メッセージの保持、再生機能、コンシューマーグループなどのユニークな特性を提供する分散型ストリーミングプラットフォームとして広く普及しています。Kafka は非常に拡張性が高く、耐障害性に優れており、多くの近代的なシステムの要になりつつあります。とはいえ、Kafka単体で存在するものではなく、アプリケーションに適したメッセージング技術を選択するのは難しいことです。 link:https://medium.com/@graemecolman/mind-your-amqps-or-kafka-or-interconnect-what-is-in-the-red-hat-messaging-box-9ed5aa590e92[このリンク先] のように、あなたの決定を後押しするために役立つ記事がたくさんあります。この記事は Kafka についてのもので、AMQP についての同等の記事は後日公開される予定です。

source: https://kafka.apache.org[Apache Kafka] is a popular open-source distributed event streaming platform. It is used commonly for high-performance data pipelines, streaming analytics, data integration, and mission-critical applications. Similar to a message queue, or an enterprise messaging platform, it lets you:
ja_jp: link:https://kafka.apache.org[Apache Kafka] は、人気の高いオープンソースの分散型イベントストリーミングプラットフォームです。 高性能なデータパイプライン、ストリーミング分析、データ統合、ミッションクリティカルなアプリケーションなどによく利用されています。 メッセージキューやエンタープライズメッセージングプラットフォームに似ており、以下のことが可能です。

source: https://kind.sigs.k8s.io/[Kind] is another popular tool used as a Kubernetes cluster for development purposes. To make the deployment to Kind experience as frictionless as possible, Quarkus provides the `quarkus-kind` extension. This extension can be added to a project like so:
ja_jp: https://kind.sigs.k8s.io/[Kind] は、開発目的で Kubernetes クラスターとして使用されるもう 1 つの一般的なツールです。Kind エクスペリエンスへのデプロイを可能な限りスムーズにするために、Quarkus は `quarkus-kind` エクステンションを提供します。このエクステンションは、次のようにプロジェクトに追加できます。

source: https://kotlinlang.org/[Kotlin] is a very popular programming language that targets the JVM (amongst other environments). Kotlin has experienced a surge in popularity the last few years making it the most popular JVM language, except for Java of course.
ja_jp: link:https://kotlinlang.org/[Kotlin] は、JVMをターゲットにした(他の環境を含めても)非常に人気のあるプログラミング言語です。Kotlinはここ数年で人気が急上昇し、Javaを除いて最も人気のあるJVM言語となっています。

source: https://kubernetes.io/docs/reference/using-api/cel/[Kubernetes CEL Validation]
ja_jp: https://kubernetes.io/docs/reference/using-api/cel/[Kubernetes CEL バリデーション]

source: https://learn.microsoft.com/en-us/azure/azure-functions/functions-run-local#v2[Azure Functions Core Tools] version 4.x
ja_jp: link:https://learn.microsoft.com/en-us/azure/azure-functions/functions-run-local#v2[Azure Functions Core Tools] バージョン4.x

source: https://lit.dev/docs/[Lit documentation]
ja_jp: https://lit.dev/docs/[Lit ドキュメント]

source: https://logicdrop.com[Logicdrop^] provides a business automation and data intelligence platform that enables enterprises to design their own solutions and run them in the cloud. We process millions of transactions a month across a global client-base and add significant value to mission-critical processes.
ja_jp: https://logicdrop.com[Logicdrop^] は、ビジネスオートメーションとデータインテリジェンスのプラットフォームを提供し、企業が独自のソリューションを設計し、クラウドで実行できるようにしています。グローバルな顧客ベースで毎月数百万件のトランザクションを処理し、ミッションクリティカルなプロセスに大きな価値を与えています。

source: https://marketplace.eclipse.org/content/quarkus-tools[Quarkus Tools for Eclipse]
ja_jp: link:https://marketplace.eclipse.org/content/quarkus-tools[Quarkus Tools for Eclipse]

source: https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Quarkus Tools for Visual Studio Code]
ja_jp: link:https://marketplace.visualstudio.com/items?itemName=redhat.vscode-quarkus[Quarkus Tools for Visual Studio Code]

source: https://netflixtechblog.com/enhancing-netflix-reliability-with-service-level-prioritized-load-shedding-e735e6ce8f7d[Enhancing Netflix Reliability with Service-Level Prioritized Load Shedding]
ja_jp: https://netflixtechblog.com/enhancing-netflix-reliability-with-service-level-prioritized-load-shedding-e735e6ce8f7d[サービスレベルの優先順位付けされた負荷制限による Netflix の信頼性向上]

source: https://netty.io/[Netty] memory management metrics are important because Quarkus is built on top of https://vertx.io/[Eclipse Vert.x], which is a framework built on top of Netty to create reactive applications in Java. Even if you use imperative style programing in Quarkus, under the surface it is conveniently handled by Vert.x in a reactive way.
ja_jp: https://netty.io/[Netty] のメモリ管理メトリクスは重要です。なぜなら、Quarkus は https://vertx.io/[Eclipse Vert.x] 上に構築されており、Vert.x は Java でリアクティブアプリケーションを作成するために Netty 上に構築されたフレームワークだからです。Quarkus で命令型プログラミングスタイルを使用する場合でも、内部的には Vert.x によってリアクティブな方法で便利に処理されます。

source: https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[Standard OIDC client authentication text] describes the claims that the generated token must contain but the values of these claims may have to be overridden.
ja_jp: https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[標準 OIDC クライアント認証テキスト] は、生成されたトークンに含める必要があるクレームについて説明していますが、これらのクレームの値はオーバーライドする必要がある場合があります。

source: https://openid.net/specs/openid-connect-registration-1_0.html[OIDC client registration]
ja_jp: https://openid.net/specs/openid-connect-registration-1_0.html[OIDC クライアント登録]

source: https://opentelemetry.io/docs/specs/semconv/http/http-metrics/#metric-httpserverresponsebodysize[`http.server.response.body.size`] (xref:opentelemetry-metrics#histograms[Histogram])
ja_jp: https://opentelemetry.io/docs/specs/semconv/http/http-metrics/#metric-httpservercallbodysize[`http.server.response.body.size`] (xref:opentelemetry-metrics#histograms[Histogram])

source: https://opentelemetry.io/docs/what-is-opentelemetry/[OpenTelemetry] is an Observability framework and toolkit designed to create and manage telemetry data such as traces, metrics, and logs. Crucially, OpenTelemetry is vendor- and tool-agnostic.
ja_jp: https://opentelemetry.io/docs/what-is-opentelemetry/[OpenTelemetry] は、トレース、メトリクス、ログなどのテレメトリーデータを作成および管理するために設計されたオブザーバビリティフレームワークおよびツールキットです。ここで重要なのは、OpenTelemetry がベンダーやツールに依存しないことです。

source: https://ostranme.github.io/swagger-ui-themes/[Swagger UI Themes] are now available in configuration, with the default theme being 'feeling blue'.
ja_jp: https://ostranme.github.io/swagger-ui-themes/[SwaggerのUIテーマ]が設定で利用できるようになり、デフォルトのテーマは「フィーリングブルー」になっています。

source: https://owasp.org/www-community/attacks/csrf[Cross-Site Request Forgery (CSRF)] is an attack that forces an end user to execute unwanted actions on a web application in which they are currently authenticated.
ja_jp: link:https://owasp.org/www-community/attacks/csrf[クロスサイトリクエストフォージェリ（CSRF）] とは、エンドユーザーが現在認証されているウェブアプリケーション上で意図しないアクションを実行させる攻撃です。

source: https://owasp.org/www-community/attacks/csrf[OWASP Cross-Site Request Forgery]
ja_jp: link:https://owasp.org/www-community/attacks/csrf[OWASP クロスサイトリクエストフォージェリ]

source: https://picocli.info/[Picocli] is an open source tool for creating rich command line applications.
ja_jp: link:https://picocli.info/[Picocli] は、リッチなコマンドラインアプリケーションを作成するためのオープンソースツールです。

source: https://plugins.jetbrains.com/plugin/13234-quarkus-tools[Quarkus Tools for IntelliJ] is a free and open source extension, helping users develop Quarkus applications by providing content-assist, validation, run configurations and many other features right from their favourite IDE.
ja_jp: link:https://plugins.jetbrains.com/plugin/13234-quarkus-tools[Quarkus Tools for IntelliJ] は、無料でオープンソースのエクステンションです。コンテンツアシスト、検証、実行設定、その他多くの機能をお気に入りのIDEから利用でき、Quarkusアプリケーションの開発を支援します。

source: https://podman.io/[Podman] is a daemonless and rootless container engine for developing, managing, and running OCI Containers on your Linux system or other OS. If you're using Podman with Quarkus, some one-off setup is needed, but once it's done, you can take advantage of all the Quarkus features.
ja_jp: https://podman.io/[Podman] は、Linux システムや他の OS 上で OCI コンテナーを開発、管理、実行するためのデーモンレスかつルートレスのコンテナーエンジンです。Podman を Quarkus と一緒に使用する場合、一回限りのセットアップが必要ですが、一度セットアップすれば、Quarkus のすべての機能を利用することができます。
